{"class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "batch_input_shape": [null, 180, 320, 3], "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "center": true, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 16, "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 8, "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_4", "bias_regularizer": null, "units": 64, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_5", "bias_regularizer": null, "units": 32, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_6", "bias_regularizer": null, "units": 4, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "softmax"}}]}