{"config": [{"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "axis": -1, "batch_input_shape": [null, 180, 320, 3], "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_5", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_6", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_7", "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_8", "filters": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "units": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "units": 32}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "units": 4}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_14", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}