{"config": [{"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "dtype": "float32", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "batch_input_shape": [null, 180, 320, 3], "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "name": "batch_normalization_15"}, "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_53", "filters": 64, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_92"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_54", "filters": 32, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_93"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_26", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_55", "filters": 16, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_94"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_56", "filters": 8, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_95"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_27", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_14"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 64, "activity_regularizer": null, "trainable": true, "name": "dense_40", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_96"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 32, "activity_regularizer": null, "trainable": true, "name": "dense_41", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_97"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 4, "activity_regularizer": null, "trainable": true, "name": "dense_42", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_98"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}